<template>
  <router-view></router-view>
</template>

<script>
import * as echarts from 'echarts'
import effects01 from './utils/js/effects01.js'
import effects02 from './utils/js/effects02.js'
import {
  provide,
  onMounted,
} from 'vue'
import axios from "axios";
export default {
  name: 'App',
  setup() {
    // 数据表
    provide('ec', echarts) // provide

    onMounted(() => {
      console.log(`
    ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ¼¼¼¼¼ÜÜÜÜÜÜÜÜÜÜÜÜ¼Ü¼¼¼ÜÜ¼¼¼
    ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ¼Ü¼¼ÜÜÜÜÜÜÜÜÜÜÜÜÜÜ¼Ü¼Ü¼ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ¼Ü¼ÜÜ¼¼¼Ü¼¼Ü¼¼¼¼¼¼
    ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ¼¼ÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜÜ¼¼ÜÜ¼¼ÜÜÜ¼ÜÜÜ¼¼¼¼¼ÜÜÜ¼¼Ü¼¼¼¼ÜÜ¼¼¼¼¼
    ÜÜÜÜÜÜÜÜÜÜ¼Ü¼ÜÜÜÜ¼¼¼¼¼¼Ü¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼¼ÜÜ¼¼¼¼¼¼¼ÜÜÜ¼¼
    ÜÜÜ¼ÜÜÜÜÜÜÜÜÜÜÜ¼¼¼¼¼¼ÜÜ[Ü[[[[[[[[[ÜÜÜÜ¼ÜÜÜÜ¼¼[¼[¼ÜÜ¼¼¼¼¼¼¼¼¼ÜÜÜ¼¼¼¼¼ÜÜ¼¼ÜÜ¼¼¼¼Ü¼
    ÜÜÜÜÜÜÜÜÜÜ¼Ü¼¼¼Ü¼ÜÜÜÜ[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[¼[Ü¼¼¼¼¼¼ÜÜÜ¼¼¼¼¼¼Ü¼ÜÜ¼ÜÜ¼
    ÜÜÜÜÜÜÜÜ¼ÜÜÜÜÜÜÜÜÜ[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[Ü[ÜÜ¼ÜÜÜÜ¼¼¼ÜÜÜÜÜ¼
    ÜÜÜÜÜÜÜ¼¼¼¼¼¼¼¼¼Ü[[[[[[[[[[¼[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[¼¼¼¼¼¼¼¼¼¼¼ÜÜÜÜ¼
    ÜÜÜÜ¼ÜÜ¼¼¼¼¼¼¼¼Ü[[[ÜÜÜ[¼¼¼¼Ü¼Ü[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[¼¼¼¼¼¼¼¼¼Ü¼ÜÜÜÜ
    ÜÜÜÜÜÜÜÜÜÜÜÜÜ¼¼Ü[[[¼[¼¼ü███████████▄[[░░░░░░░░░░░░░[[░░[[[[[[[[[[[[¼¼¼¼ÜÜ¼¼Ü¼ÜÜ¼
    ÜÜ¼Ü¼¼¼¼Ü¼¼¼[Ü[[[[¼Ü¼▓████████████████▄[░░░░░░░░░░░░░░░[[[[[[[[[[¼[¼¼¼¼¼¼¼¼¼¼ÜÜ¼
    ÜÜ¼Ü¼¼¼¼¼Ü[[[[[[[¼¼█████████████████████▄░░░░░░░░░░░░░░░░[[[[[[[[[[¼¼¼¼¼¼¼¼¼¼¼¼Ü
    ÜÜ¼Ü¼¼¼¼¼¼[[[Ü[[[▓████████████████████████[░░░░░░░░░░░░░░[[[[[[[[[[¼¼Ü¼¼¼¼¼¼¼¼¼¼
    █Ü¼Ü¼¼¼ÜÜ[[[[Ü[¼¼██████████████████████████░░░░░││░░░░░░[░[[[[[[[¼¼¼¼¼¼¼¼¼¼¼ÜÜÜ¼
    ██¼¼ÜÜÜ¼¼[▄▄█▄¼¼▓███████████████████████████░░░░░░│░░░░░░[[[[[[[¼[¼¼¼¼Ü¼¼¼¼¼ÜÜÜ¼
    ██████ÿÜ[▓██████████████████████████████████[░░░░░░░░░░░[[[[[[[[[¼¼¼¼¼¼¼¼¼¼¼Ü¼¼Ü
    █████████████████████████████████████████████[░░░░░░░[░[[[[[[[¼¼[¼¼¼¼¼¼¼¼¼ÜÜÜÜÜ¼
    █████████████████████████████████████████▒▓██Ü[░░░░[[[░[[[[[[[[¼¼¼Ü¼¼¼¼¼ÜÜÜÜ¼Ü¼Ü
    █████▓███████████████████████████████████████Ü¼[░[[[[[[[[[[Ü[¼¼¼¼¼¼¼Ü¼ÜÜÜÜÜÜÜ¼¼¼
    █████████████████████████████████▓███████▓████▄█[[[[[[[¼[[¼¼¼¼¼¼¼¼¼¼¼ÜÜ¼¼¼¼ÜÜ¼¼Ü
    ███████████████████████████████▓███▓▓▓▓▓▒▓▓███████[¼¼[▄[▄█▄ç¼¼¼¼Ü¼¼Ü¼ÜÜÜÜ¼¼ÜÜÜÜÜ
    ███████████████████████████████▒▓▓██████▓▒▓█████████████████████Ü¼Ü¼¼ÜÜÜÜÜÜÜ¼ÜÜÜ
    ███████████████████████████████████▓█████▓██████████████████████▒ù%ÜÜÜÜÜÜÜÜÜÜÜÜÜ
    ███████████████████████████████████▓█████▓██████████████████▓██████ÜÜ¼ÜÜÜ¼¼¼ÜÜÜ¼
    ████████████████████████████████▓▓▓▓▓██▓▓██████████████████▓▓████████¼ÉÜÜÜÜÉÉÉÜÜ
    ██████▓█████████████████████████████▓▓▓██████████████████▓███▓█▓████▓▓██████████
    █████▓▓██████████████████████████▓▓█▓████████▓████▓███████████████▒▒▓▓██████████
    ████▓▓████████████████████████████████▓▓ÜÜⁿ▓█▓▓ÜÜÜÜÜÜÜ▓██████▓█████▓▓▓██████████
    ████████▓▓████████████████████████████▓ÜÉ¼Ü¼Ü[ÜÜÜⁿ%▒▒É½▒▓▓▓██▓██▓███▓▓▓▓███▓▓█▓█
    █████▓▓▓▓▓███████████████████████████▓ÜÜ¼Ü¼ÜÉ¼%Ü¼Ü[Üⁿ▓▓▓▓▓@▓▓▓▓▓█████▓██████████
    ████▓▓▓▓▓▓▓██████████████████████████Ü¼¼Ü¼¼ÉÜ¼Ü¼Ü¼¼¼ÜÜÜ▓▓▒ÜÜ▓▓▓██████▓▓█████████
    █▓¼▓▓▓▓▓▓████████████████████▓▓▓▓███ÜÜ¼▒¼ÜÜ▓▒Ü½Ü¼¼¼Ü¼ÜÜ[▓███▓▒▒▓▓█████▓▓████████
    ¼ÉÉÖÖ▓▓▓█▓███████████████████▓▓▓███Ü¼É▒ÜÜÉÜ%▓ÉÜ¼½É¼Ü¼¼Ü¼¼[▓████▓▓▓█████▓████████
    ÉÉÉÉÉ▓▓▓▓▓██████████████████▓█████▒½ÉÉ▓¼ÉÉÉÖ▓É¼ÜÉ▒½▒ÉÉÜÜÜ¼¼Å███████████▓████████
    É¼ÜÜÜÉÖ▓▓▓████████████████████▓▓▓WÜ▒▒▓%▒▒▓▓¼▓▒Ü▒▓▒▓▒▒%ÉÜÜÜÜ¼Å▓▓█████████▓███████
    ▓████▒ÜÜ▓▓▓████████████████████▒▒▒▓▒▓▒%▓▓▓▓▓█▓█▓█▒▒▒%ÉÜÜ▄MMMÜ▓██████████████████
    █▓▓▓▓▓▓█▒▓▓████████████████████▒▒▓▓▒▓▓▒███████████▒▓██▓▓▓▒▒▒▓▓█████▓▓█▓█████████
    ▓▓▓▓▓▓▓███████████████████████▒▓▓███▓█▒▓████████████████▓▓▓▓▓▓▓██████▓▓▓████▓▓▓▒
    ▓▓▓▓▓███████████████████████████▓▒▓████▓█████████████████▓▓▓▓▓▓▓███████▓▒▒▓▒▒▓▓▓
    ▓▓▓▓▓██████████████████████████▒██▓▒▓██▓███▓██▓████████████▓▓▓▓▓▓███████▓██▓████
    ▓▓▓████████████████████████████▒▓██▒▓▓▓▓▓▓▓▓█▓██████████████▓▓▓▓▓▓▓██████▓█▓████
    ▓▓████████████████████████████▓▓██▓▓▓▓▓████▓▒▓█████████████████▓▓▓▓▓███████▒█▓▓█
    █████████████████████████████▓▓██▓▓████████▒▒▓██████████████████████▓▓███████▓██
    ████████████████████████████████▓▓█████████▒▒▓████████████████████████████████▓█
    ███████████████████████████▓████████████████▓▓███████████████████████████▓██████
    ███████████████████████████▓█████████████▓█▓▓▓█████▓███████████████████████▓████
    ████████████████████████████████████████████████████████████████████████████████
    ██████████████████████████████████████████████████████████████████████████████▓█`)

      /**
      * 模块名:
      * 代码描述: 查询系统设置保存在本地，判断对应特效展示
      * 作者:lizibin
      * 创建时间:2022/12/31 19:30:29
      */
      axios.get("/systemSetup/showAllSystemSetup").then(res => {
        let data = res.data.data
        let data1 = JSON.stringify(res.data.data)
        localStorage.setItem("SystemData", data1);
        // 点击网站页面显示24字核心价值观上升的特效
        if (data === 1) {
          let body = document.getElementsByTagName("body")[0];
          body.classList.add('effects01')
        }
        // 雪花飘落特效
        if (data === 1) {
          const effects02 = document.getElementById("effects02");
          effects02.style.display = 'block'
        }
        // 网页黑白
        if (data.effects03 === 1) {
          document.body.style.filter = "grayscale(1)"
        }
        // 网页背景图
        if (data.advertising5 != '') {
          document.body.style.background = `url(${process.env.VUE_APP_URL}${res.data.data.advertising5})`
          document.body.style.backgroundSize = `cover`
          document.body.style.backgroundPosition = `center center`
          document.body.style.backgroundRepeat = `no-repeat`
          document.body.style.backgroundAttachment = `fixed`
          document.documentElement.style.background = `url(${process.env.VUE_APP_URL}${res.data.data.advertising5})`
          document.documentElement.style.backgroundSize = `cover`
          document.documentElement.style.backgroundPosition = `center center`
          document.documentElement.style.backgroundRepeat = `no-repeat`
          document.documentElement.style.backgroundAttachment = `fixed`
        }
      })
    })
  },
  components: {}
}
</script>

<style>

</style>